{"cells":[{"cell_type":"markdown","metadata":{},"source":["# Создаем игру \"угадай число\"\n","Суть игры заключается в том, что компьютер загадывает число, а мы его должны угадать менее чем за 20 попыток. Под «угадать» подразумевается «написать программу, которая угадывает число»."]},{"cell_type":"code","execution_count":3,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Число: 38 --- Попытка: 1\n","Число: 38 --- Попытка: 2\n","Число: 38 --- Попытка: 3\n","Число: 38 --- Попытка: 4\n","Число: 38 --- Попытка: 5\n","Число: 38 --- Попытка: 6\n","Алгоритм рассчитал число 38 за 6 попыток\n"]}],"source":["from my_game import random_predict"]},{"cell_type":"markdown","metadata":{},"source":["Полный код будет выглядеть следующим образом:"]},{"cell_type":"code","execution_count":4,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Число: 38 --- Попытка: 1\n","Число: 38 --- Попытка: 2\n","Число: 38 --- Попытка: 3\n","Число: 38 --- Попытка: 4\n","Число: 38 --- Попытка: 5\n","Число: 38 --- Попытка: 6\n","Алгоритм рассчитал число 38 за 6 попыток\n"]},{"data":{"text/plain":["6"]},"execution_count":4,"metadata":{},"output_type":"execute_result"}],"source":["\"\"\"Игра угадай число\"\"\"\n","import numpy as np\n","def random_predict(number: int = 1) -> int:\n","    \"\"\"Угадываем число\n","    Args:\n","        number (int, optional): _Загаданное число_. Defaults to 1.\n","    Returns:\n","        int: с какой попытки угадали\n","    \"\"\" \n","    np.random.seed(1) # фиксируем загаданное число    \n","    number = np.random.randint(1, 101) # загадываем число\n","    count = 0  # задаем счетчик\n","    min_num = 1\n","    max_num = 100\n","\n","    while True:\n","        count += 1\n","        print('Число:', number, '---', 'Попытка:', count)\n","\n","        predict_num = int(( min_num + max_num) / 2)  # загадываем число как среднее между минимальным и максимальным и отбрасываем дробную часть\n","\n","        if predict_num > number:\n","            max_num = predict_num\n","        elif predict_num < number:\n","            min_num = predict_num\n","        else:\n","            print(f'Алгоритм рассчитал число {number} за {count} попыток')\n","            break\n","    return count\n","random_predict()"]},{"cell_type":"markdown","metadata":{},"source":["Мы можем запустить игру, учитывается ограничение в количестве попыток. Оптимальным решением было использовать бинарный метод."]}],"metadata":{"language_info":{"name":"python"},"orig_nbformat":4},"nbformat":4,"nbformat_minor":2}
